"""
Финализаторы — закрываем браузер
Вероятно, вы заметили, что мы не использовали в этом примере команду browser.quit(). Это привело к тому, что несколько
окон браузера оставались открыты после окончания тестов, а закрылись только после завершения всех тестов. Закрытие
браузеров произошло благодаря встроенной фикстуре — сборщику мусора. Но если бы количество тестов насчитывало больше
нескольких десятков, то открытые окна браузеров могли привести к тому, что оперативная память закончилась бы очень
быстро. Поэтому надо явно закрывать браузеры после каждого теста. Для этого мы можем воспользоваться финализаторами.
Один из вариантов финализатора — использование ключевого слова Python: yield. После завершения теста, который вызывал
фикстуру, выполнение фикстуры продолжится со строки, следующей за строкой со словом yield:
"""

import pytest
from selenium import webdriver
from selenium.webdriver.common.by import By

urlLink = "http://selenium1py.pythonanywhere.com/"

@pytest.fixture
def browser():
    print('\nСтарт браузера для теста...')
    browser = webdriver.Chrome()
    # Команда для закрытия браузера
    yield browser
    # этот код выполнится после завершения теста
    print('\nЗавершение работы браузера...')
    browser.quit()

class TestMainPage1():
    # вызываем фикстуру в тесте, передав ее как параметр
    def test_guest_should_see_login_link(self, browser):
        browser.get(urlLink)
        browser.find_element(By.CSS_SELECTOR, "#login_link")

    def test_guest_should_see_basket_link_on_the_main_page(self, browser):
        browser.get(urlLink)
        browser.find_element(By.CSS_SELECTOR, ".basket-mini .btn-group > a")

"""
Есть альтернативный способ вызова teardown кода с помощью встроенной фикстуры request и ее метода addfinalizer. 
Можете изучить его сами по документации PyTest. 

Рекомендуем также выносить очистку данных и памяти в фикстуру, вместо того чтобы писать это в шагах теста: 
финализатор выполнится даже в ситуации, когда тест упал с ошибкой. 
"""